       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       000-Main. *>Can this be something else?
           DISPLAY "Hello from COBOL"
           STOP RUN.
       END PROGRAM MAIN.
